exercises.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-03 Mo 11:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Exercises</title>
<meta name="author" content="Christoph Schottmüller" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Exercises</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb5056e8">1. Week 2</a></li>
<li><a href="#org7976982">2. Week 3</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5056e8" class="outline-2">
<h2 id="orgb5056e8"><span class="section-number-2">1.</span> Week 2</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><p>
Type the following code into the REPL
</p>
<div class="org-src-container">
<pre class="src src-julia">var1 = <span style="color: #93E0E3;">"a"</span>
var2 = <span style="color: #93E0E3;">'b'</span>
</pre>
</div>
<p>
What does the code do? Which of the following lines of code are valid and which will give you an error? First think what you expect to happen and then check.
</p>
<div class="org-src-container">
<pre class="src src-julia">var1+var2

var1*var2

var1+1

var2+1

var1*1

var2*1

var1^3

var2^3

var1 &lt; <span style="color: #93E0E3;">"c"</span>

var1 &lt; <span style="color: #93E0E3;">'c'</span>

var2 &gt; <span style="color: #93E0E3;">'c'</span>

var1*<span style="color: #93E0E3;">"1+$var2"</span>

var1*<span style="color: #93E0E3;">"$(1+var2)"</span>

<span style="color: #93E0E3;">"var1*$(var2)"</span>

<span style="color: #93E0E3;">"$(var1)*$(var2)"</span>

length(var1)+2

length(var2)+3

[i <span style="color: #7F9F7F; font-weight: bold;">for</span> i <span style="color: #7F9F7F; font-weight: bold;">in</span> 1:10]

join(<span style="color: #93E0E3;">"0"</span>,[i <span style="color: #7F9F7F; font-weight: bold;">for</span> i <span style="color: #7F9F7F; font-weight: bold;">in</span> 1:9])

string(<span style="color: #93E0E3;">"0"</span>,[i <span style="color: #7F9F7F; font-weight: bold;">for</span> i <span style="color: #7F9F7F; font-weight: bold;">in</span> 1:9])

string(<span style="color: #93E0E3;">"0"</span>,join([i <span style="color: #7F9F7F; font-weight: bold;">for</span> i <span style="color: #7F9F7F; font-weight: bold;">in</span> 1:9]))

[var1+i <span style="color: #7F9F7F; font-weight: bold;">for</span> i <span style="color: #7F9F7F; font-weight: bold;">in</span> 1:5]

[string(var1,i) <span style="color: #7F9F7F; font-weight: bold;">for</span> i <span style="color: #7F9F7F; font-weight: bold;">in</span> 1:5]

join([var2+i <span style="color: #7F9F7F; font-weight: bold;">for</span> i <span style="color: #7F9F7F; font-weight: bold;">in</span> 1:5])
</pre>
</div></li>

<li><p>
Using list comprehension create an array that contains all the lower case characters of the alphabet and bind this array to the variable name <i>alphabet</i>. (<i>Hint:</i> Recall that <i>'a'+0='a'</i>, <i>'a'+1='b'</i> etc.)
</p>

<p>
Then create a single string that contains all the letters of the alphabet and bind it to the name <i>alphabetstring</i>. Al so create another string variable <i>alphabetcomma</i> that contains all letters of the alphabet separated by comma.
</p>

<p>
Next create an array that contains the string "letter number 1 in the alphabet is a" as first element, the string "letter number 2 in the alphabet is b" as its second element and so on until "letter number 26 in the alphabet is z".
</p></li>
<li>Use the <i>string</i> function with the keyword <i>pad</i> as well as a list comprehension and the <i>join</i> function to create a string "101001000100001000001000000100000001". Can you also do it without using <i>pad</i> (and without typing it in digit by digit, of course)?</li>
</ol>
</div>
</div>
<div id="outline-container-org7976982" class="outline-2">
<h2 id="org7976982"><span class="section-number-2">2.</span> Week 3</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
Out of how many code blocks does the following code block consist and what does the function <i>move1</i> do?
</p>
<div class="org-src-container">
<pre class="src src-julia">var = <span style="color: #93E0E3;">"xyz"</span>
<span style="color: #7F9F7F; font-weight: bold;">function</span> <span style="color: #8CD0D3;">move1</span>(input)
    output = string(input[2:<span style="color: #7F9F7F; font-weight: bold;">end</span>],input[1])
    <span style="color: #7F9F7F; font-weight: bold;">return</span> output
<span style="color: #7F9F7F; font-weight: bold;">end</span>
move1(var)
</pre>
</div></li>

<li><p>
If we add the following to the code of the previous exercise
</p>
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #7F9F7F; font-weight: bold;">function</span> <span style="color: #8CD0D3;">move1</span>(input::<span style="color: #F0DFAF;">Number</span>)
    output = input + 1
    <span style="color: #7F9F7F; font-weight: bold;">return</span> output
<span style="color: #7F9F7F; font-weight: bold;">end</span>
</pre>
</div>
<p>
What output do you expect for the following function calls? Think first before trying!
</p>
<div class="org-src-container">
<pre class="src src-julia">move1(3)
move1(3.0)
move1(<span style="color: #93E0E3;">"3"</span>)
move1(<span style="color: #93E0E3;">"3.0"</span>)
move1(<span style="color: #93E0E3;">'3'</span>)
move1([1, 2, 3])
</pre>
</div></li>

<li>Write a function <i>addfractions(numerator1,denominator1,numerator2,denominator2)</i> that returns the sum of the fractions \(numerator1/denominator1\)  and \(numerator2/denominator2\) as \(numeratorSum,denominatorSum\); e.g. <i>addfractions(1,2,1,3)</i> should return \(5,6\) as \(1/2+1/3=5/6\). (Note that you do not have to cancel common multipliers in the result.)</li>
<li><p>
Write a function <i>evaluatef</i> that takes two inputs: (i) another function (that I call <i>f</i> in the following), (ii) a range (e.g. 1:5). The function <i>evaluatef</i> should evaluate <i>f</i> at each point of the range and print the out put. For example, if \(f(x)=x^2\), then \(evaluatef(f,1:3)\) should print:
</p>
<blockquote>
<p>
f(1) equals 1
</p>

<p>
f(2) equals 4
</p>

<p>
f(3) equals 9
</p>
</blockquote>
<p>
(<i>Hint:</i> to get the text printed line by line you have to recall what we did last week, namely list comprehension and escape sequences.)
</p></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christoph Schottmüller</p>
<p class="date">Created: 2023-04-03 Mo 11:51</p>
</div>
</body>
</html>
